In [1]:
import numpy as np
import pandas as pd
import sqlite3
from IPython.display import display

In [2]:
# Read the following data set: https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data
adultdata_df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',header=None)
display(adultdata_df.head())

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [3]:
# Rename the columns as per the description from the below file/URL:
# Name the columns as per the file https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.names
adultdata_df.columns =["age","workclass","fnlwgt","education","education-num","marital-status","occupation","relationship",
                       "race","sex","capital-gain","capital-loss","hours-per-week","native-country","income"]
display(adultdata_df.head())

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
adultdata_df.shape

(32561, 15)

In [5]:
# 1.  Create an sqlalchemy engine using a sample from the data set
import sqlalchemy
from sqlalchemy import create_engine

engine = create_engine('sqlite:///sqladb1', echo=False)
adultdata_df.to_sql('sqladb1', engine, if_exists='replace')
conn  = sqlite3.connect("sqladb1")
cur = conn.cursor()

In [6]:
# 2.  Write two basic update queries
print(' First basic update query: \n', '*'*25)
print(' \n Values before update: \n', '-'*21)
print(pd.read_sql_query('SELECT * FROM sqladb1 WHERE fnlwgt = "83311"', conn).head())
cur.execute('UPDATE sqladb1 SET fnlwgt = "83312" WHERE fnlwgt = "83311" and "education-num" = "13"')
print('\n\n Values after update: \n', '-'*20)
print(pd.read_sql_query('SELECT * FROM sqladb1 WHERE fnlwgt = "83311"', conn).head())

 First basic update query:
 *************************

 Values before update:
 ---------------------
   index  age          workclass  fnlwgt     education  education-num  \
0      1   50   Self-emp-not-inc   83311     Bachelors             13
1  16474   54   Self-emp-not-inc   83311   Prof-school             15

        marital-status        occupation relationship    race    sex  \
0   Married-civ-spouse   Exec-managerial      Husband   White   Male
1   Married-civ-spouse    Prof-specialty      Husband   White   Male

   capital-gain  capital-loss  hours-per-week  native-country  income
0             0             0              13   United-States   <=50K
1             0             0              30   United-States    >50K


 Values after update:
 --------------------
   index  age          workclass  fnlwgt     education  education-num  \
0  16474   54   Self-emp-not-inc   83311   Prof-school             15

        marital-status       occupation relationship    race    sex  \
0   Married-civ-spouse   Prof-specialty      Husband   White   Male

   capital-gain  capital-loss  hours-per-week  native-country income
0             0             0              30   United-States   >50K

In [7]:
# 2.  Write two basic update queries
print(' Second basic update query: \n', '*'*25)
print(' \n Values before update for workclass = " ?": \n', '-'*21)
print(pd.read_sql_query('SELECT count(*) FROM sqladb1 WHERE workclass = " ?"', conn).head())
cur.execute('UPDATE sqladb1 SET workclass = " Other" WHERE workclass = " ?"')
print('\n\n Values after update for workclass = " ?": \n', '-'*20)
print(pd.read_sql_query('SELECT count(*) FROM sqladb1 WHERE workclass = " ?"', conn).head())
print('\n\n Values after update for workclass = " Other": \n', '-'*20)
print(pd.read_sql_query('SELECT count(*) FROM sqladb1 WHERE workclass = " Other"', conn).head())

 Second basic update query:
 *************************

 Values before update for workclass = " ?":
 ---------------------
   count(*)
0      1836


 Values after update for workclass = " ?":
 --------------------
   count(*)
0         0


 Values after update for workclass = " Other":
 --------------------
   count(*)
0      1836

In [8]:
# 3.  Write two delete queries 
print(' First delete query: \n', '*'*25)
print(' \n Values before delete: \n', '-'*21)
print(pd.read_sql_query('SELECT count(*) FROM sqladb1 where workclass = " Other" and income = " <=50K"', conn).head())
cur.execute('DELETE from sqladb1 where workclass = " Other" and income = " <=50K"')
print('\n\n Values after delete: \n', '-'*20)
print(pd.read_sql_query('SELECT count(*) FROM sqladb1 where workclass = " Other" and income = " <=50K"', conn).head())

 First delete query:
 *************************

 Values before delete:
 ---------------------
   count(*)
0      1645


 Values after delete:
 --------------------
   count(*)
0         0

In [9]:
# 3.  Write two delete queries 
print(' Second delete query: \n', '*'*25)
print(' \n Values before delete: \n', '-'*21)
print(pd.read_sql_query('SELECT count(*) FROM sqladb1 where workclass = " Other"', conn).head())
cur.execute('DELETE from sqladb1 where workclass = " Other"')
print('\n\n Values after delete: \n', '-'*20)
print(pd.read_sql_query('SELECT count(*) FROM sqladb1 where workclass = " Other"', conn).head())

 Second delete query:
 *************************

 Values before delete:
 ---------------------
   count(*)
0       191


 Values after delete:
 --------------------
   count(*)
0         0

In [10]:
# 4.  Write two filter queries 
print(' First filter query: \n', '*'*25)
print(pd.read_sql_query('SELECT * from sqladb1 WHERE fnlwgt = "99199" and "education-num" = "9"', conn).head())

 First filter query:
 *************************
   index  age          workclass  fnlwgt education  education-num  \
0   7135   21            Private   99199   HS-grad              9
1   9923   22            Private   99199   HS-grad              9
2  17431   21   Self-emp-not-inc   99199   HS-grad              9
3  26933   21        Federal-gov   99199   HS-grad              9

        marital-status          occupation relationship    race    sex  \
0        Never-married   Machine-op-inspct    Own-child   White   Male
1   Married-civ-spouse     Exec-managerial      Husband   White   Male
2   Married-civ-spouse        Craft-repair      Husband   White   Male
3        Never-married        Adm-clerical    Own-child   White   Male

   capital-gain  capital-loss  hours-per-week  native-country  income
0             0             0              32   United-States   <=50K
1             0             0              48   United-States   <=50K
2             0             0              40   United-States   <=50K
3             0             0              36   United-States   <=50K

In [11]:
# 4.  Write two filter queries 
print(' Second filter query: \n', '*'*25)
print(pd.read_sql_query('SELECT * from sqladb1 WHERE age between "30" and "35" and "marital-status" IN (" Never-married" , \
                        " Unmarried") and education = " Masters"', conn).head())
cur.close()
conn.close()

 Second filter query:
 *************************
   index  age workclass  fnlwgt education  education-num  marital-status  \
0      8   31   Private   45781   Masters             14   Never-married
1    661   35   Private  261293   Masters             14   Never-married
2    696   35   Private  203628   Masters             14   Never-married
3    821   31   Private  171871   Masters             14   Never-married
4   1240   35   Private   33975   Masters             14   Never-married

        occupation    relationship    race      sex  capital-gain  \
0   Prof-specialty   Not-in-family   White   Female         14084
1            Sales   Not-in-family   White     Male             0
2   Prof-specialty   Not-in-family   White     Male             0
3   Prof-specialty   Not-in-family   White   Female             0
4   Prof-specialty   Not-in-family   White     Male             0

   capital-loss  hours-per-week  native-country  income
0             0              50   United-States    >50K
1             0              60   United-States   <=50K
2             0              60   United-States    >50K
3             0              46   United-States   <=50K
4             0              45   United-States    >50K

In [12]:
conn  = sqlite3.connect("sqladb1")
cur = conn.cursor()

In [13]:
from sqlalchemy import Table, select, MetaData
metadata = MetaData(bind = None)
table = Table('sqladb1', metadata, autoload= True, autoload_with = engine)
table

Table('sqladb1', MetaData(bind=None), Column('index', BIGINT(), table=<sqladb1>), Column('age', BIGINT(), table=<sqladb1>), Column('workclass', TEXT(), table=<sqladb1>), Column('fnlwgt', BIGINT(), table=<sqladb1>), Column('education', TEXT(), table=<sqladb1>), Column('education-num', BIGINT(), table=<sqladb1>), Column('marital-status', TEXT(), table=<sqladb1>), Column('occupation', TEXT(), table=<sqladb1>), Column('relationship', TEXT(), table=<sqladb1>), Column('race', TEXT(), table=<sqladb1>), Column('sex', TEXT(), table=<sqladb1>), Column('capital-gain', BIGINT(), table=<sqladb1>), Column('capital-loss', BIGINT(), table=<sqladb1>), Column('hours-per-week', BIGINT(), table=<sqladb1>), Column('native-country', TEXT(), table=<sqladb1>), Column('income', TEXT(), table=<sqladb1>), schema=None)

In [14]:
# 5.  Write two function queries
print(' First function query \n', '*'*20)
select([table])
engine.execute(select([table])).fetchone()

 First function query
 ********************

(0, 39, ' State-gov', 77516, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K')

In [15]:
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker

base = declarative_base()
base.metadata.create_all(engine)
Session = sessionmaker(bind=engine)
session = Session()

In [16]:
print(' Second function query \n', '*'*21)
select([table])
session.query(table).filter(table.columns.fnlwgt == "224634").all()

 Second function query
 *********************

[(7131,
  28,
  ' Private',
  224634,
  ' Bachelors',
  13,
  ' Married-civ-spouse',
  ' Prof-specialty',
  ' Wife',
  ' White',
  ' Female',
  0,
  0,
  45,
  ' United-States',
  ' >50K')]

In [17]:
print(' Writing own insert function query \n', '*'*49)
def new_entry(db_file, new_data):
    query = "INSERT INTO sqladb1 VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);"
    cur.execute(query, list(new_data))
    print('Inserted 1 new row')

new_entry('sqladb',('32660', '30','Private', '7861369', 'Masters', '9', 'Married', 'Front_End', 'In_Family', 
                    'Indian', 'Male', '0', '0', '40', 'United-States', '>=50K'))

 Writing own insert function query
 *************************************************
Inserted 1 new row

In [18]:
print(' Writing own select function query \n', '*'*49)
def age_check():
    cur1 = cur.execute('SELECT * from sqladb1 WHERE fnlwgt = "7861369"')
    output = cur1.fetchall()
    print(output)    
    
age_check()

 Writing own select function query
 *************************************************
[(32660, 30, 'Private', 7861369, 'Masters', 9, 'Married', 'Front_End', 'In_Family', 'Indian', 'Male', 0, 0, 40, 'United-States', '>=50K')]

In [19]:
cur.close()
conn.close()